In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={'Name':['Vikas','God','random','Galactus','thanu babes'],
      'Marks':[45,232,1,23,18],
      'Place':['Earth','Heaven','random','milkyway','titan']}

In [3]:
dp=pd.DataFrame(dict1)# DataFrame returns a table with the labels as name , marks and place

In [4]:
dp

          Name  Marks     Place
0        Vikas     45     Earth
1          God    232    Heaven
2       random      1    random
3     Galactus     23  milkyway
4  thanu babes     18     titan

In [5]:
dp.to_csv('sample.csv') # Will make and save a csv file with these contents

In [6]:
dp.to_csv('smaple_withoutindex.csv',index=False) # will make and save a file without the index numbers

In [7]:
dp.head(2)

    Name  Marks   Place
0  Vikas     45   Earth
1    God    232  Heaven

In [8]:
dp.tail(2)

          Name  Marks     Place
3     Galactus     23  milkyway
4  thanu babes     18     titan

In [9]:
#.tail and .head is used to fetch few indexes from the head or tail
# This is used for large dataframes having many indexes(rows)

In [10]:
dp.describe() # describes countable attribute of the dataframe

            Marks
count    5.000000
mean    63.800000
std     95.329429
min      1.000000
25%     18.000000
50%     23.000000
75%     45.000000
max    232.000000

In [11]:
VIKAS=pd.read_csv('VIKAS.csv') # READING A CSV FILE FROM THE SYSTEM

In [12]:
VIKAS

   number  speed  name
0     123      54   T1
1     124      55   T2
2     128      69   T3
3     126      40   T4

In [13]:
VIKAS['name']# WE CAN ACCESS THE VALUES TRHOUGH SIMPLE INDEXING

0    T1
1    T2
2    T3
3    T4
Name: name, dtype: object

In [14]:
VIKAS['name'][2]

'T3'

In [15]:
VIKAS['name'][2]='T69' # ALTHOUGH IT WILL SHOW A WARNING , IT WILL CHANGE THE NAME FROM T3 TO T69

C:\Users\vikas\AppData\Local\Temp\ipykernel_10132\2432668904.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  VIKAS['name'][2]='T69' # ALTHOUGH IT WILL SHOW A WARNING , IT WILL CHANGE THE NAME FROM T3 TO T69

In [16]:
VIKAS

   number  speed  name
0     123      54   T1
1     124      55   T2
2     128      69  T69
3     126      40   T4

In [17]:
VIKAS.index=['first','second','third','fourth']# We can also change the value of the index

In [18]:
VIKAS

        number  speed  name
first      123      54   T1
second     124      55   T2
third      128      69  T69
fourth     126      40   T4

In [19]:
# Panda is an open source software written in python used for data analysis
# By taking advantage of numpy's speed and power to make it easier for data analysis and preprocessing

In [20]:
# Pandas has 2 types of data structures 
# series : 1-D Array with indexes storing a single column or row of data in a dataframe
# Dataframe : similar to a spreadsheet structure having rows and colomns

In [21]:
ser=pd.Series(np.random.rand(34)) # used to generate a series of numbers

In [22]:
ser #SERIES

0     0.385083
1     0.748318
2     0.142228
3     0.942495
4     0.713682
5     0.011705
6     0.455951
7     0.396422
8     0.546685
9     0.786460
10    0.931753
11    0.650043
12    0.278949
13    0.102803
14    0.852913
15    0.697421
16    0.230639
17    0.834120
18    0.604254
19    0.961287
20    0.719494
21    0.232063
22    0.106643
23    0.083538
24    0.546247
25    0.682876
26    0.761448
27    0.188957
28    0.041536
29    0.663562
30    0.155727
31    0.159038
32    0.440143
33    0.029950
dtype: float64

In [23]:
type(ser)

pandas.core.series.Series

In [24]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [25]:
newdf#DATAFRAME

            0         1         2         3         4
0    0.792054  0.466023  0.091853  0.478882  0.846913
1    0.913672  0.586304  0.761903  0.453714  0.045113
2    0.703188  0.294033  0.798553  0.681721  0.282514
3    0.758696  0.870107  0.103961  0.593302  0.131365
4    0.085147  0.403180  0.790300  0.711646  0.920102
..        ...       ...       ...       ...       ...
329  0.664052  0.874155  0.910846  0.358662  0.660002
330  0.849185  0.348962  0.903993  0.908577  0.564370
331  0.507964  0.903428  0.092433  0.974950  0.905415
332  0.286384  0.708574  0.342657  0.896959  0.667065
333  0.229084  0.100015  0.685370  0.824870  0.409014

[334 rows x 5 columns]

In [26]:
newdf.head()

          0         1         2         3         4
0  0.792054  0.466023  0.091853  0.478882  0.846913
1  0.913672  0.586304  0.761903  0.453714  0.045113
2  0.703188  0.294033  0.798553  0.681721  0.282514
3  0.758696  0.870107  0.103961  0.593302  0.131365
4  0.085147  0.403180  0.790300  0.711646  0.920102

In [27]:
newdf.tail()

            0         1         2         3         4
329  0.664052  0.874155  0.910846  0.358662  0.660002
330  0.849185  0.348962  0.903993  0.908577  0.564370
331  0.507964  0.903428  0.092433  0.974950  0.905415
332  0.286384  0.708574  0.342657  0.896959  0.667065
333  0.229084  0.100015  0.685370  0.824870  0.409014

In [28]:
type(newdf)

pandas.core.frame.DataFrame

In [29]:
newdf.describe() # describes the mean,standard deviation,etc of each colomn

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.513143    0.500957    0.535185    0.506038    0.486827
std      0.283491    0.283342    0.285690    0.292317    0.285252
min      0.004790    0.001357    0.000287    0.002299    0.003304
25%      0.238071    0.262171    0.306629    0.239867    0.231697
50%      0.531234    0.481932    0.528214    0.507892    0.488047
75%      0.741707    0.736098    0.778924    0.773155    0.741469
max      0.992124    0.999562    0.999931    0.998809    0.996752

In [30]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
newdf[0][0]='Vikas'

In [32]:
newdf

            0         1         2         3         4
0       Vikas  0.466023  0.091853  0.478882  0.846913
1    0.913672  0.586304  0.761903  0.453714  0.045113
2    0.703188  0.294033  0.798553  0.681721  0.282514
3    0.758696  0.870107  0.103961  0.593302  0.131365
4    0.085147  0.403180  0.790300  0.711646  0.920102
..        ...       ...       ...       ...       ...
329  0.664052  0.874155  0.910846  0.358662  0.660002
330  0.849185  0.348962  0.903993  0.908577  0.564370
331  0.507964  0.903428  0.092433  0.974950  0.905415
332  0.286384  0.708574  0.342657  0.896959  0.667065
333  0.229084  0.100015  0.685370  0.824870  0.409014

[334 rows x 5 columns]

In [33]:
type(newdf[0][0])

str

In [34]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [35]:
len(newdf[0])

334

In [36]:
newdf.columns# tells us about the range of the columns

RangeIndex(start=0, stop=5, step=1)

In [37]:
newdf.to_numpy() # Returns a numpy array consisting of all the values in the newdf dataframe

array([['Vikas', 0.46602296230828966, 0.0918525536079361,
        0.4788817173000146, 0.8469125598645035],
       [0.913671691682287, 0.5863041902441449, 0.7619030987621794,
        0.4537137221016512, 0.04511287215882542],
       [0.703187711202604, 0.2940333276711995, 0.7985527554085518,
        0.6817206835205601, 0.282513561927182],
       ...,
       [0.5079642646488073, 0.9034282132095756, 0.0924331120720131,
        0.974950045096437, 0.9054146324844371],
       [0.28638417650381154, 0.7085739140245886, 0.34265714063813024,
        0.8969591689903806, 0.6670646433712084],
       [0.22908444671320438, 0.10001461999676287, 0.6853702491983519,
        0.824870433360145, 0.4090140538938135]], dtype=object)

In [38]:
newdf[0][0]=0.34332

In [39]:
newdf

            0         1         2         3         4
0     0.34332  0.466023  0.091853  0.478882  0.846913
1    0.913672  0.586304  0.761903  0.453714  0.045113
2    0.703188  0.294033  0.798553  0.681721  0.282514
3    0.758696  0.870107  0.103961  0.593302  0.131365
4    0.085147  0.403180  0.790300  0.711646  0.920102
..        ...       ...       ...       ...       ...
329  0.664052  0.874155  0.910846  0.358662  0.660002
330  0.849185  0.348962  0.903993  0.908577  0.564370
331  0.507964  0.903428  0.092433  0.974950  0.905415
332  0.286384  0.708574  0.342657  0.896959  0.667065
333  0.229084  0.100015  0.685370  0.824870  0.409014

[334 rows x 5 columns]

In [40]:
newdf.sort_index(axis=1,ascending=True) # sort the array accoring to the index and ascending

            0         1         2         3         4
0     0.34332  0.466023  0.091853  0.478882  0.846913
1    0.913672  0.586304  0.761903  0.453714  0.045113
2    0.703188  0.294033  0.798553  0.681721  0.282514
3    0.758696  0.870107  0.103961  0.593302  0.131365
4    0.085147  0.403180  0.790300  0.711646  0.920102
..        ...       ...       ...       ...       ...
329  0.664052  0.874155  0.910846  0.358662  0.660002
330  0.849185  0.348962  0.903993  0.908577  0.564370
331  0.507964  0.903428  0.092433  0.974950  0.905415
332  0.286384  0.708574  0.342657  0.896959  0.667065
333  0.229084  0.100015  0.685370  0.824870  0.409014

[334 rows x 5 columns]

In [41]:
newdf[0]

0       0.34332
1      0.913672
2      0.703188
3      0.758696
4      0.085147
         ...
329    0.664052
330    0.849185
331    0.507964
332    0.286384
333    0.229084
Name: 0, Length: 334, dtype: object

In [42]:
type(newdf[0])# Dataframes are made up of series

pandas.core.series.Series

In [43]:
newdf2=newdf # newdf2 is the view of newdf, it is like a pointer to the original 
# Anychanges made to newdf2 it will be reflected on the original

In [44]:
newdf2[0][0]=34343

C:\Users\vikas\AppData\Local\Temp\ipykernel_10132\2451555297.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=34343

In [45]:
newdf

            0         1         2         3         4
0       34343  0.466023  0.091853  0.478882  0.846913
1    0.913672  0.586304  0.761903  0.453714  0.045113
2    0.703188  0.294033  0.798553  0.681721  0.282514
3    0.758696  0.870107  0.103961  0.593302  0.131365
4    0.085147  0.403180  0.790300  0.711646  0.920102
..        ...       ...       ...       ...       ...
329  0.664052  0.874155  0.910846  0.358662  0.660002
330  0.849185  0.348962  0.903993  0.908577  0.564370
331  0.507964  0.903428  0.092433  0.974950  0.905415
332  0.286384  0.708574  0.342657  0.896959  0.667065
333  0.229084  0.100015  0.685370  0.824870  0.409014

[334 rows x 5 columns]

In [46]:
newdf2=newdf.copy() # This will make a copy of newdf without affecting the original

In [47]:
newdf2[0][0]=56

C:\Users\vikas\AppData\Local\Temp\ipykernel_10132\204995665.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=56

In [48]:
newdf.head(2)

          0         1         2         3         4
0     34343  0.466023  0.091853  0.478882  0.846913
1  0.913672  0.586304  0.761903  0.453714  0.045113

In [49]:
newdf2.head(2)# Different from the original after changes

          0         1         2         3         4
0        56  0.466023  0.091853  0.478882  0.846913
1  0.913672  0.586304  0.761903  0.453714  0.045113

In [50]:
newdf.loc[0,0]=1 # We can change individual values without getting a warning

In [51]:
newdf.head()

          0         1         2         3         4
0         1  0.466023  0.091853  0.478882  0.846913
1  0.913672  0.586304  0.761903  0.453714  0.045113
2  0.703188  0.294033  0.798553  0.681721  0.282514
3  0.758696  0.870107  0.103961  0.593302  0.131365
4  0.085147  0.403180  0.790300  0.711646  0.920102

In [52]:
newdf.columns=list('ABCDE')

In [53]:
newdf.head(2)

          A         B         C         D         E
0         1  0.466023  0.091853  0.478882  0.846913
1  0.913672  0.586304  0.761903  0.453714  0.045113

In [54]:
newdf.loc[0,'C']=4454

In [55]:
newdf.head(2)

          A         B            C         D         E
0         1  0.466023  4454.000000  0.478882  0.846913
1  0.913672  0.586304     0.761903  0.453714  0.045113

In [56]:
# If we try to access a column which is not present inside the dataframe then 
# it will add the data to that column

In [57]:
newdf.loc[0,0]=100 # adds an extra column with 0 as its label

In [58]:
newdf

            A         B            C         D         E      0
0           1  0.466023  4454.000000  0.478882  0.846913  100.0
1    0.913672  0.586304     0.761903  0.453714  0.045113    NaN
2    0.703188  0.294033     0.798553  0.681721  0.282514    NaN
3    0.758696  0.870107     0.103961  0.593302  0.131365    NaN
4    0.085147  0.403180     0.790300  0.711646  0.920102    NaN
..        ...       ...          ...       ...       ...    ...
329  0.664052  0.874155     0.910846  0.358662  0.660002    NaN
330  0.849185  0.348962     0.903993  0.908577  0.564370    NaN
331  0.507964  0.903428     0.092433  0.974950  0.905415    NaN
332  0.286384  0.708574     0.342657  0.896959  0.667065    NaN
333  0.229084  0.100015     0.685370  0.824870  0.409014    NaN

[334 rows x 6 columns]

In [59]:
# To remove an extra column from the dataframe we use drop

In [60]:
newdf=newdf.drop(0,axis=1)# By default axis=0, also mention the name of the columns

In [61]:
newdf

            A         B            C         D         E
0           1  0.466023  4454.000000  0.478882  0.846913
1    0.913672  0.586304     0.761903  0.453714  0.045113
2    0.703188  0.294033     0.798553  0.681721  0.282514
3    0.758696  0.870107     0.103961  0.593302  0.131365
4    0.085147  0.403180     0.790300  0.711646  0.920102
..        ...       ...          ...       ...       ...
329  0.664052  0.874155     0.910846  0.358662  0.660002
330  0.849185  0.348962     0.903993  0.908577  0.564370
331  0.507964  0.903428     0.092433  0.974950  0.905415
332  0.286384  0.708574     0.342657  0.896959  0.667065
333  0.229084  0.100015     0.685370  0.824870  0.409014

[334 rows x 5 columns]

In [62]:
# .loc is used to access the elements passed in the arguements

In [63]:
newdf.loc[[1,2],['C','D']] # Returns a new dataframe with aforementioned rows,columns

          C         D
1  0.761903  0.453714
2  0.798553  0.681721

In [64]:
newdf.loc[:,['A','B']]

            A         B
0           1  0.466023
1    0.913672  0.586304
2    0.703188  0.294033
3    0.758696  0.870107
4    0.085147  0.403180
..        ...       ...
329  0.664052  0.874155
330  0.849185  0.348962
331  0.507964  0.903428
332  0.286384  0.708574
333  0.229084  0.100015

[334 rows x 2 columns]

In [65]:
newdf.loc[[1,2],:]

          A         B         C         D         E
1  0.913672  0.586304  0.761903  0.453714  0.045113
2  0.703188  0.294033  0.798553  0.681721  0.282514

In [66]:
newdf.loc[(newdf['A']<0.3)] # returns all the rows which have value <0.3 in column 'A'

            A         B         C         D         E
4    0.085147  0.403180  0.790300  0.711646  0.920102
5    0.220194  0.243711  0.499444  0.190554  0.211543
6    0.097494  0.187555  0.433556  0.518750  0.274906
7    0.170913  0.995518  0.078455  0.130782  0.096627
9    0.251821  0.724452  0.996727  0.800803  0.482183
..        ...       ...       ...       ...       ...
322  0.189588  0.563635  0.439632  0.471540  0.418976
323  0.248191  0.827262  0.186969  0.449989  0.865901
325  0.212019  0.528975  0.999931  0.259337  0.317388
332  0.286384  0.708574  0.342657  0.896959  0.667065
333  0.229084  0.100015  0.685370  0.824870  0.409014

[102 rows x 5 columns]

In [67]:
newdf.loc[(newdf['A']>0.3) & (newdf['A']<0.8)]

            A         B         C         D         E
2    0.703188  0.294033  0.798553  0.681721  0.282514
3    0.758696  0.870107  0.103961  0.593302  0.131365
13   0.475741  0.174523  0.388232  0.215847  0.281466
15   0.709244  0.252371  0.010466  0.266711  0.660338
18   0.484978  0.401116  0.394416  0.056658  0.183139
..        ...       ...       ...       ...       ...
321  0.610946  0.807400  0.198198  0.269059  0.083316
326  0.479026  0.171082  0.430151  0.639022  0.080709
327  0.587038  0.376173  0.592981  0.865079  0.796261
329  0.664052  0.874155  0.910846  0.358662  0.660002
331  0.507964  0.903428  0.092433  0.974950  0.905415

[166 rows x 5 columns]

In [68]:
newdf.iloc[0,3]# prints the 4th column value of the 1st row

0.4788817173000146

In [69]:
newdf.iloc[[0,3],[1,0]]# iloc allows us to use the actual index of the rows and columns instead of any explicit assigned names

          B         A
0  0.466023         1
3  0.870107  0.758696

In [70]:
newdf.head()

          A         B            C         D         E
0         1  0.466023  4454.000000  0.478882  0.846913
1  0.913672  0.586304     0.761903  0.453714  0.045113
2  0.703188  0.294033     0.798553  0.681721  0.282514
3  0.758696  0.870107     0.103961  0.593302  0.131365
4  0.085147  0.403180     0.790300  0.711646  0.920102

In [71]:
newdf.drop(['A','C'],axis=1) # note by adding inplace =True , it will make permanent changes to the original dataframe

            B         D         E
0    0.466023  0.478882  0.846913
1    0.586304  0.453714  0.045113
2    0.294033  0.681721  0.282514
3    0.870107  0.593302  0.131365
4    0.403180  0.711646  0.920102
..        ...       ...       ...
329  0.874155  0.358662  0.660002
330  0.348962  0.908577  0.564370
331  0.903428  0.974950  0.905415
332  0.708574  0.896959  0.667065
333  0.100015  0.824870  0.409014

[334 rows x 3 columns]

In [72]:
newdf.drop(['A','C'], axis=1,inplace=True)

In [73]:
newdf.drop([1,6,8],axis=0,inplace = True)

In [74]:
newdf.head(4)

          B         D         E
0  0.466023  0.478882  0.846913
2  0.294033  0.681721  0.282514
3  0.870107  0.593302  0.131365
4  0.403180  0.711646  0.920102

In [75]:
newdf.reset_index(drop=True,inplace=True)# resets the index from 0

In [76]:
newdf

            B         D         E
0    0.466023  0.478882  0.846913
1    0.294033  0.681721  0.282514
2    0.870107  0.593302  0.131365
3    0.403180  0.711646  0.920102
4    0.243711  0.190554  0.211543
..        ...       ...       ...
326  0.874155  0.358662  0.660002
327  0.348962  0.908577  0.564370
328  0.903428  0.974950  0.905415
329  0.708574  0.896959  0.667065
330  0.100015  0.824870  0.409014

[331 rows x 3 columns]

In [77]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
326    False
327    False
328    False
329    False
330    False
Name: B, Length: 331, dtype: bool

In [78]:
newdf.loc[:,['B']]=None

In [79]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
326    True
327    True
328    True
329    True
330    True
Name: B, Length: 331, dtype: bool

In [80]:
df = pd.DataFrame({"name": [np.nan, 'Batman', 'Catwoman','Batman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip','Batmobile'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT,pd.Timestamp("1940-03-15")]})

In [81]:
df.head()

       name        toy       born
0       NaN        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Batman  Batmobile 1940-03-15

In [82]:
df.dropna()#Removes all rows which have na

     name        toy       born
1  Batman  Batmobile 1940-04-25
3  Batman  Batmobile 1940-03-15

In [83]:
df

       name        toy       born
0       NaN        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Batman  Batmobile 1940-03-15

In [84]:
df.dropna(how='all') # until all the columns or rows are na , then only that row or column can be dropped

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Batman  Batmobile 1940-03-15

In [85]:
df1=df

In [86]:
df1

       name        toy       born
0       NaN        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Batman  Batmobile 1940-03-15

In [87]:
df.dropna(how='all', axis=1)

       name        toy       born
0       NaN        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Batman  Batmobile 1940-03-15

In [88]:
df.drop_duplicates()# Will drop all duplicate rows of whose each column name are same

       name        toy       born
0       NaN        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Batman  Batmobile 1940-03-15

In [89]:
df.drop_duplicates(subset=['name'])# Drops all duplicates having the same subset

       name        toy       born
0       NaN        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [91]:
df.drop_duplicates(subset=['name'],keep='last')#Keeps the last duplicate and deletes the rest

       name        toy       born
0       NaN        NaN        NaT
2  Catwoman   Bullwhip        NaT
3    Batman  Batmobile 1940-03-15

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     3 non-null      object
 2   born    2 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 224.0+ bytes

In [94]:
df['name'].value_counts()#By default dropna=True

Batman      2
Catwoman    1
Name: name, dtype: int64

In [95]:
df['name'].value_counts(dropna=False)

Batman      2
NaN         1
Catwoman    1
Name: name, dtype: int64

In [96]:
dict2={'id':[68,69,70],
      'Marks':[99,94,96],
      'age':[21,20,22]}

In [98]:
df=pd.DataFrame(dict2)

In [99]:
df

   id  Marks  age
0  68     99   21
1  69     94   20
2  70     96   22

In [100]:
df.describe()

         id      Marks   age
count   3.0   3.000000   3.0
mean   69.0  96.333333  21.0
std     1.0   2.516611   1.0
min    68.0  94.000000  20.0
25%    68.5  95.000000  20.5
50%    69.0  96.000000  21.0
75%    69.5  97.500000  21.5
max    70.0  99.000000  22.0

In [101]:
df.mean()

id       69.000000
Marks    96.333333
age      21.000000
dtype: float64

In [102]:
df.max()

id       70
Marks    99
age      22
dtype: int64

In [104]:
df.min()

id       68
Marks    94
age      20
dtype: int64

In [105]:
df.median()

id       69.0
Marks    96.0
age      21.0
dtype: float64

In [106]:
df.mode()

   id  Marks  age
0  68     94   20
1  69     96   21
2  70     99   22

In [107]:
df.std()

id       1.000000
Marks    2.516611
age      1.000000
dtype: float64

In [108]:
df.corr()

            id    Marks      age
id     1.00000 -0.59604  0.50000
Marks -0.59604  1.00000  0.39736
age    0.50000  0.39736  1.00000

In [113]:
data=pd.read_csv('data.csv')

In [114]:
data

   id    name  age
0   1   first   10
1   2  second   11
2   3   third   11

In [126]:
data=pd.read_excel('new.xlsx')

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.